Revit 2026 API

# HvacFailures Properties

---

The BuiltInFailuresHvacFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PanelDoesntMatchCircuitPropertiesDisconnected | The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit? |

#### Reference

BuiltInFailuresHvacFailures Class

Autodesk.Revit.DB Namespace